import type { Metadata } from "next";

export const metadata: Metadata = {
  title: "Проекты · newermamalchik",
  description: "Взгляните на мои работы — не шаблонные поделки, а уникальные проекты с характером и историей. От веб-сайтов и API до игровых модификаций и Discord-ботов.",
  openGraph: {
    title: "Проекты · newermamalchik",
    description: "Взгляните на мои работы — не шаблонные поделки, а уникальные проекты с характером и историей. От веб-сайтов и API до игровых модификаций и Discord-ботов.",
  },
  keywords: [
    "авторские проекты", 
    "веб-разработка с душой", 
    "нестандартные решения", 
    "портфолио разработчика", 
    "игровые модификации",
    "кастомная разработка",
    "typescript проекты",
    "minecraft разработка",
    "discord боты"
  ],
}; 